apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_pm.c
  return ERROR;
}

/****************************************************************************
 * Name:  esp32s3_periph_inform_out_sleep_overhead
 *
 * Description:
 *   Inform peripherals of light sleep wakeup overhead time
 *
 * Input Parameters:
 *   us - Light sleep wakeup overhead time
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_periph_inform_out_sleep_overhead(uint32_t us)
{
  for (int i = 0; i < PERIPH_INFORM_OUT_SLEEP_OVERHEAD_NO; i++)
    {
      if (g_periph_inform_out_sleep_overhead_cb[i])
        {
          g_periph_inform_out_sleep_overhead_cb[i](us);
        }
    }
}

/****************************************************************************
 * Name:  esp32s3_sleep_enable_timer_wakeup
 *
 * Description:
 *   Enable wakeup by timer
 *
 * Input Parameters:
 *   time_in_us - Configure wake-up time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_sleep_enable_timer_wakeup(uint64_t time_in_us)
{
  g_config.wakeup_triggers |= RTC_TIMER_TRIG_EN;
  g_config.sleep_duration = time_in_us;
}

/****************************************************************************
 * Name:  esp32s3_sleep_enable_wifi_wakeup
 *
 * Description:
 *   Configure Wi-Fi wake-up source
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32s3_sleep_enable_wifi_wakeup(void)
{
  g_config.wakeup_triggers |= RTC_WIFI_TRIG_EN;
}

/****************************************************************************
 * Name:  esp32s3_light_sleep_start
 *
 * Description:
 *   Enter light sleep mode
 *
 * Input Parameters:
 *   sleep_time - Actual sleep time
 *
 * Returned Value:
 *   0 is returned on success or a negated errno value is returned
 *
 ****************************************************************************/

int IRAM_ATTR esp32s3_light_sleep_start(uint64_t *sleep_time)
{
  int ret = OK;
  irqstate_t flags;
  uint32_t pd_flags;
  uint32_t flash_enable_time_us;
  uint32_t vddsdio_pd_sleep_duration;
  struct esp32s3_rtc_vddsdio_config_s vddsdio_config;
  uint32_t rtc_cntl_xtl_buf_wait_cycles;
  uint32_t sleep_time_overhead_in;
  uint32_t ccount_at_sleep_start;
  int64_t final_sleep_us;
  int64_t min_sleep_us;

  flags = enter_critical_section();

  g_config.ccount_ticks_record = XTHAL_GET_CCOUNT();
  g_config.rtc_ticks_at_sleep_start = esp32s3_rtc_time_get();
  ccount_at_sleep_start = XTHAL_GET_CCOUNT();
  sleep_time_overhead_in = (ccount_at_sleep_start -
    g_config.ccount_ticks_record) / (esp_clk_cpu_freq() / 1000000ULL);

  /* Decide which power domains can be powered down */

  pd_flags = esp32s3_get_power_down_flags();
  pd_flags &= ~RTC_SLEEP_PD_RTC_PERIPH;
  g_config.rtc_clk_cal_period =
        esp32s3_rtc_clk_cal(RTC_CAL_RTC_MUX, RTC_CLK_SRC_CAL_CYCLES);

  /* Adjustment time consists of parts below:
   * 1. Hardware time waiting for internal 8M oscillate clock and XTAL;
   * 2. Hardware state switching time of the rtc main state machine;
   * 3. Code execution time when clock is not stable;
   * 4. Code execution time which can be measured;
   */

  rtc_cntl_xtl_buf_wait_cycles = esp32s3_rtc_time_us_to_slowclk(
        RTC_CNTL_XTL_BUF_WAIT_SLP_US, g_config.rtc_clk_cal_period);

  g_config.sleep_time_adjustment = LIGHT_SLEEP_TIME_OVERHEAD_US +
        sleep_time_overhead_in + g_config.sleep_time_overhead_out
        + esp32s3_rtc_time_slowclk_to_us(rtc_cntl_xtl_buf_wait_cycles +
        RTC_CNTL_CK8M_WAIT_SLP_CYCLES + RTC_CNTL_WAKEUP_DELAY_CYCLES,
        g_config.rtc_clk_cal_period);

  flash_enable_time_us = VDD_SDIO_POWERUP_TO_FLASH_READ_US
                         + DEEP_SLEEP_WAKEUP_DELAY;

  esp32s3_periph_inform_out_sleep_overhead(
    g_config.sleep_time_adjustment - sleep_time_overhead_in);

  esp32s3_get_vddsdio_config(&vddsdio_config);

  final_sleep_us = (int64_t)g_config.sleep_duration -
                   (int64_t)g_config.sleep_time_adjustment;
  min_sleep_us = esp32s3_rtc_time_slowclk_to_us(RTC_CNTL_MIN_SLP_VAL_MIN,
                                                g_config.rtc_clk_cal_period);

  /* If rtc timer wakeup source is enabled, need to compare final
   *  sleep duration and min sleep duration to avoid late wakeup
   */

  if ((g_config.wakeup_triggers & RTC_TIMER_TRIG_EN) &&
      (final_sleep_us <= min_sleep_us))
    {
      ret = ERROR;
    }
  else
    {
      /* Enter sleep, then wait for flash to be ready on wakeup */

      ret = esp32s3_light_sleep_inner(pd_flags, flash_enable_time_us,
                                      vddsdio_config);
    }

  if (sleep_time != NULL)
    {
      *sleep_time = esp32s3_rtc_time_slowclk_to_us(esp32s3_rtc_time_get() -
          g_config.rtc_ticks_at_sleep_start, g_config.rtc_clk_cal_period);
    }

  g_config.sleep_time_overhead_out = (XTHAL_GET_CCOUNT() -
       g_config.ccount_ticks_record) / (esp_clk_cpu_freq() / 1000000ULL);

  leave_critical_section(flags);

  return ret;
}

/****************************************************************************
 * Name: esp32s3_pmstandby
 *
 * Description:
 *   Enter force sleep.
 *
 * Input Parameters:
 *   time_in_us - Force sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32s3_pmstandby(uint64_t time_in_us)
{
  uint64_t rtc_diff_us;

  /* Don't power down XTAL - powering it up takes different time on. */

  esp32s3_sleep_enable_timer_wakeup(time_in_us);
  esp32s3_light_sleep_start(&rtc_diff_us);
  pwrinfo("Returned from auto-sleep, slept for %" PRIu32 " ms\n",
            (uint32_t)(rtc_diff_us) / 1000);
}

/****************************************************************************
 * Name:  esp32s3_deep_sleep_start
 *
 * Description:
 *   Enter deep sleep mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_deep_sleep_start(void)
{
  uint32_t pd_flags;

  /* Record current RTC time */

  g_config.rtc_ticks_at_sleep_start = esp32s3_rtc_time_get();

