apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_pm.c
  /* Decide which power domains can be powered down */

  pd_flags = esp32s3_get_power_down_flags();
  g_config.rtc_clk_cal_period = getreg32(RTC_SLOW_CLK_CAL_REG);

  /* Correct the sleep time */

  g_config.sleep_time_adjustment = DEEP_SLEEP_TIME_OVERHEAD_US;

  pd_flags |= RTC_SLEEP_PD_DIG | RTC_SLEEP_PD_VDDSDIO |
              RTC_SLEEP_PD_INT_8M | RTC_SLEEP_PD_XTAL;

  /* Enter deep sleep */

  esp32s3_sleep_start(pd_flags);

  /* Because RTC is in a slower clock domain than the CPU, it
   * can take several CPU cycles for the sleep mode to start.
   */

  while (1);
}

/****************************************************************************
 * Name: esp32s3_pmsleep
 *
 * Description:
 *   Enter deep sleep.
 *
 * Input Parameters:
 *   time_in_us - Deep sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32s3_pmsleep(uint64_t time_in_us)
{
  esp32s3_sleep_enable_timer_wakeup(time_in_us);
  esp32s3_deep_sleep_start();
}

/****************************************************************************
 * Name: esp32s3_pm_lockacquire
 *
 * Description:
 *   Take a power management lock
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_pm_lockacquire(void)
{
  ++pm_wakelock;
}

/****************************************************************************
 * Name: esp32s3_pm_lockrelease
 *
 * Description:
 *   Release the lock taken using esp32s3_pm_lockacquire.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_pm_lockrelease(void)
{
  --pm_wakelock;
}

/****************************************************************************
 * Name: esp32s3_pm_lockstatus
 *
 * Description:
 *   Return power management lock status.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Current pm_wakelock count
 *
 ****************************************************************************/

uint32_t IRAM_ATTR esp32s3_pm_lockstatus(void)
{
  return pm_wakelock;
}

#endif /* CONFIG_PM */
